using System;

namespace Decorator
{
    /// <summary>
    /// Паттерн: Decorator (Декоратор)
    /// Type: Structural (Структурный)
    /// О чём паттерн: Позволяет подключать к объекту дополнительную функциональность динамически
    ///                за счет оборачивания в новую обёртку.
    /// Плюсы:
    ///     + Позволяет добавлять новые возможности объектам на этапе выполнения программы.
    ///     + Позволяет добавлять новые возможности объектом, к коду которых нет доступа
    /// 
    /// Минусы:
    ///     - 
    ///     - 
    /// 
    /// Когда использовать:
    ///     * Когда нужно динамически добавлять к объекту новые функции
    ///     * 
    /// 
    ///     
    /// 
    /// </summary>
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
